In [1]:
import pandas as pd
import numpy as np

In [4]:
dict1={'Names':['Aravind','Samar',np.nan,'Siri'],
       'Age':[np.nan,21,32,43],
       'City':['Hyd','Blr','Chennai',np.nan]}
dict1

{'Names': ['Aravind', 'Samar', nan, 'Siri'],
 'Age': [nan, 21, 32, 43],
 'City': ['Hyd', 'Blr', 'Chennai', nan]}

In [6]:
d1=pd.DataFrame(dict1)

In [7]:
d1.dtypes

Names     object
Age      float64
City      object
dtype: object

In [9]:
dict2={'Names':['Aravind','Samar',None,'Siri'],
       'Age':[np.nan,21,32,43],
       'City':['Hyd','Blr','Chennai',None]}
pd.DataFrame(dict2)

     Names   Age     City
0  Aravind   NaN      Hyd
1    Samar  21.0      Blr
2     None  32.0  Chennai
3     Siri  43.0     None

In [10]:
d1.isnull()

   Names    Age   City
0  False   True  False
1  False  False  False
2   True  False  False
3  False  False   True

In [11]:
d1.isnull().sum()

Names    1
Age      1
City     1
dtype: int64

In [12]:
d1.isnull().sum()/len(d1)*100

Names    25.0
Age      25.0
City     25.0
dtype: float64

- np.nan: not a number, Generally this is applicable for numerical columns only
- Generally data has some empty rows
- It is a data problems
- If you read that kind of data you will see Null
- You need to understand it is a data corrupted or really Null values are there

#### Method-1:
**Fill it with some random value**

**Method name:** fill na

In [13]:
d1.fillna(40)

     Names   Age     City
0  Aravind  40.0      Hyd
1    Samar  21.0      Blr
2       40  32.0  Chennai
3     Siri  43.0       40

#### Method-2:
- We can fill the values w.r.t columns also

In [17]:
d1['Age'].fillna(40)

# It will not updated
# Because by default inplace=False

0    40.0
1    21.0
2    32.0
3    43.0
Name: Age, dtype: float64

In [18]:
d1

     Names   Age     City
0  Aravind  40.0      Hyd
1    Samar  21.0      Blr
2      NaN  32.0  Chennai
3     Siri  43.0      NaN

In [19]:
d1['Age'].fillna(40,inplace=True)
d1

     Names   Age     City
0  Aravind  40.0      Hyd
1    Samar  21.0      Blr
2      NaN  32.0  Chennai
3     Siri  43.0      NaN

In [20]:
dict1={'Names':['Aravind','Samar',np.nan,'Siri'],
       'Age':[np.nan,21,32,43],
        'City':['Hyd','Blr','Chennai',np.nan]}

d1=pd.DataFrame(dict1)

#### Method-3:
- bfill
- backfill

- ffill
- pad

In [21]:
d1.fillna(method='bfill')
# It will fill with below value or next value
# column1: Names index 3 is missing values it is filled with index 4 value
# column2: Age index 1 is missing values it is filled with index 2 value
# column3: City index 4 is missing values it should be fill with next value
# But we don't have next value

C:\Users\MOHD RAHEEM\AppData\Local\Temp\ipykernel_35020\3921902074.py:1: FutureWarning: DataFrame.fillna with 'method' is deprecated and will raise in a future version. Use obj.ffill() or obj.bfill() instead.
  d1.fillna(method='bfill')

     Names   Age     City
0  Aravind  21.0      Hyd
1    Samar  21.0      Blr
2     Siri  32.0  Chennai
3     Siri  43.0      NaN

In [22]:
d1.fillna(method='bfill',axis=1)
# axis=1 means columns
# So Nan values fill with next

C:\Users\MOHD RAHEEM\AppData\Local\Temp\ipykernel_35020\3962440596.py:1: FutureWarning: DataFrame.fillna with 'method' is deprecated and will raise in a future version. Use obj.ffill() or obj.bfill() instead.
  d1.fillna(method='bfill',axis=1)

     Names   Age     City
0  Aravind   Hyd      Hyd
1    Samar  21.0      Blr
2     32.0  32.0  Chennai
3     Siri  43.0      NaN

In [23]:
d1

     Names   Age     City
0  Aravind   NaN      Hyd
1    Samar  21.0      Blr
2      NaN  32.0  Chennai
3     Siri  43.0      NaN

In [24]:
d1.fillna(method='backfill')

C:\Users\MOHD RAHEEM\AppData\Local\Temp\ipykernel_35020\907203477.py:1: FutureWarning: DataFrame.fillna with 'method' is deprecated and will raise in a future version. Use obj.ffill() or obj.bfill() instead.
  d1.fillna(method='backfill')

     Names   Age     City
0  Aravind  21.0      Hyd
1    Samar  21.0      Blr
2     Siri  32.0  Chennai
3     Siri  43.0      NaN

In [26]:
d1.fillna(method='pad')

C:\Users\MOHD RAHEEM\AppData\Local\Temp\ipykernel_35020\3282249208.py:1: FutureWarning: DataFrame.fillna with 'method' is deprecated and will raise in a future version. Use obj.ffill() or obj.bfill() instead.
  d1.fillna(method='pad')

     Names   Age     City
0  Aravind   NaN      Hyd
1    Samar  21.0      Blr
2    Samar  32.0  Chennai
3     Siri  43.0  Chennai

In [27]:
d1.fillna(method='ffill')

C:\Users\MOHD RAHEEM\AppData\Local\Temp\ipykernel_35020\4088926743.py:1: FutureWarning: DataFrame.fillna with 'method' is deprecated and will raise in a future version. Use obj.ffill() or obj.bfill() instead.
  d1.fillna(method='ffill')

     Names   Age     City
0  Aravind   NaN      Hyd
1    Samar  21.0      Blr
2    Samar  32.0  Chennai
3     Siri  43.0  Chennai

- bfill and backfill with Next value
- Pad and ffill with previous value
- But it will change based on axis i.e,(axis=0 or axis=1)

# Method-4:
- **mean:**
    - Numerical values can fill with mean value
    - but is affected by outliers
    - if we dont have outliers it is best one
- **median:**
    - Numerical values can fill with median value
    - we know that median value does not affect with outliers
    - SO if outliers are there we can go with median
- **mode:**
    - Mode is useful for categorical data

In [31]:
dict1={'Names':['Aravind','Samar',np.nan,'Siri'],
       'Age':[np.nan,21,32,43],
        'City':['Hyd','Blr','Chennai',np.nan]}

d1=pd.DataFrame(dict1)
d1

     Names   Age     City
0  Aravind   NaN      Hyd
1    Samar  21.0      Blr
2      NaN  32.0  Chennai
3     Siri  43.0      NaN

In [33]:
# we already know we can fill with some values based on specific column using fi
# d1.fillna(<random_number>)
# d1 represents all the columns
age_mean=d1['Age'].mean()
d1['Age'].fillna(age_mean)

0    32.0
1    21.0
2    32.0
3    43.0
Name: Age, dtype: float64

In [35]:
age_median=d1['Age'].median()
d1['Age'].fillna(age_median)

0    32.0
1    21.0
2    32.0
3    43.0
Name: Age, dtype: float64

In [36]:
d1['City'].mode()
# In this use case we are getting mode equal
# but in real time scenarios we will get a clear mode values

0        Blr
1    Chennai
2        Hyd
Name: City, dtype: object

- Fill with random value
- Fill with random value on specific value
- Fill with methods:
    - bfill
    - backfill
    - ffill
    - pad 
    
- Fill with:
    - Mean
    - Median
    - Mode

# Method-5:
**KNN imputer**
- KNN: K-Nearest Neighbours
- K is a hyper parameter means user can choose
- It is distance metric: **Euclidean distance**
- KNN imputer will take the mean of the neighbors value
- The neighbours value can provided by using value=k
- It is under sklearn package
- Under sklearn we have Imputer method
- Under impute method we have KnnImputer
- Applicable for only Numerical data

<img alt="" style="width: 211.8px; height: 173.1px; margin-top: 3.5px; margin-left: 0px;" class="" src="https://tse2.mm.bing.net/th?id=OIP.Fg10wNqD1k3kB0MaG0YpVQHaGD&amp;pid=Api&amp;P=0&amp;h=180" id="yui_3_5_1_1_1718376736183_691">

In [37]:
from sklearn.impute import KNNImputer
KI=KNNImputer()
KI.fit_transform(d1[['Age']])

array([[32.],
       [21.],
       [32.],
       [43.]])